# St7GetSolverCreep

Returns the state assigned for the Creep option for creep analyses.

long St7GetSolverCreep(long uID, bool* Creep)
Input Parameters
uID
Strand7 model file ID.
Output Parameters
Creep
True if the Creep option is enabled.